

public class Main {
    public static void main(String[] args) {


        /*
         * не знаю где еще написать так что оставлю здесь)
         *
         * "по ТЗ у эпика дата начала определяется по самой ранней подзадаче, не нашел у тебя такого метода.
         *Тоже самое про EndTime" --- твой комментарий на 18 строчку епик таски
         * за обновление времени эпика отвечает метод updateEpicTaskStatus в InMemoryTaskManager
         * мне показалось логичным обновлять единовременно статус и время
         * на всякий случай вынес в отдельный метод
         *
         * "по ТЗ задачи выстраиваются только по атрибуту startTime, без учета EndTime" --- твой комментарий
         *  на 63 строке таска
         *
         * я понял что задачи по старт тайму должны выстраиваться только в список приоритетных задач, что делает
         * компаратор в TreeSet. Если я ничего не путаю.
         * overloop должен искать пересечения, и как я понял, не допускать их.
         *  "Проверьте пересечения
         *      Предполагается, что пользователь будет выполнять не более одной задачи за раз.
         *      Научите трекер проверять, что задачи и подзадачи не пересекаются по времени выполнения.
         *      Добавьте валидацию во время создания или изменения задач, подзадач." -- выдержка из ТЗ
         *
         *  т.е. задачи не должны пересекаться все время своего выполнения, поэтому считаю важным сравнивать
         *  именно периоды от начала до конца задачи.
         *
         */



    }
}
